In [63]:
import pandas as pd
import numpy as np

In [64]:
df1 = pd.read_csv(r'..\..\data\raw\awi_spam_emails.csv')
df2 = pd.read_csv(r'..\..\data\raw\email_spam.csv')
df3 = pd.read_csv(r'..\..\data\raw\fq_spam.csv')
df4 = pd.read_csv(r'..\..\data\raw\spam_or_not_spam.csv')
df5 = pd.read_csv(r'..\..\data\raw\uciml_spam.csv', encoding='latin')
df6 = pd.read_csv(r'..\..\data\raw\vg_email.csv')

In [65]:
dataframes = [df1, df2, df3, df4, df5, df6]
for df in dataframes:
    print(df.shape)

(5572, 2)
(5573, 2)
(5572, 2)
(3000, 2)
(5572, 5)
(5171, 4)

In [66]:
for df in dataframes:
    df.columns = df.columns.str.lower().str.replace('_', '')

In [67]:
for df in dataframes:
    display(df.describe(include='all'))
    print('--------------------------------------------------------')

       category                 message
count      5572                    5572
unique        2                    5157
top         ham  Sorry, I'll call later
freq       4825                      30

--------------------------------------------------------

       category                 message
count      5573                    5573
unique        3                    5158
top         ham  Sorry, I'll call later
freq       4825                      30

--------------------------------------------------------

       category                 message
count      5572                    5572
unique        2                    5157
top         ham  Sorry, I'll call later
freq       4825                      30

--------------------------------------------------------

                                 email        label
count                             2999  3000.000000
unique                            2872          NaN
top     url URL date not supplied URL           NaN
freq                                10          NaN
mean                               NaN     0.166667
std                                NaN     0.372740
min                                NaN     0.000000
25%                                NaN     0.000000
50%                                NaN     0.000000
75%                                NaN     0.000000
max                                NaN     1.000000

--------------------------------------------------------

,v1,v2,unnamed: 2,unnamed: 3,unnamed: 4
count,5572,5572,50,12,6
unique,2,5169,43,10,5
top,ham,"Sorry, I'll call later","bt not his girlfrnd... G o o d n i g h t . . .@""","MK17 92H. 450Ppw 16""","GNT:-)"""
freq,4825,30,3,2,2

--------------------------------------------------------

,unnamed: 0,label,text,labelnum
count,5171.000000,5171,5171,5171.000000
unique,NaN,2,4993,NaN
top,NaN,ham,Subject: calpine daily gas nomination\r\n>\r\n...,NaN
freq,NaN,3672,20,NaN
mean,2585.000000,NaN,NaN,0.289886
std,1492.883452,NaN,NaN,0.453753
min,0.000000,NaN,NaN,0.000000
25%,1292.500000,NaN,NaN,0.000000
50%,2585.000000,NaN,NaN,0.000000
75%,3877.500000,NaN,NaN,1.000000
max,5170.000000,NaN,NaN,1.000000

--------------------------------------------------------

Appears like df1 to df3 are the same

In [68]:
for df in dataframes:
    print(df.info())
    print('--------------------------------------------------------')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   category  5572 non-null   object
 1   message   5572 non-null   object
dtypes: object(2)
memory usage: 87.2+ KB
None
--------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5573 entries, 0 to 5572
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   category  5573 non-null   object
 1   message   5573 non-null   object
dtypes: object(2)
memory usage: 87.2+ KB
None
--------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   category  5572 non-null   object
 1   message   5572 non-null   object
dtypes: object(2)
memory usage: 87.2+ KB
None
--------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   email   2999 non-null   object
 1   label   3000 non-null   int64
dtypes: int64(1), object(1)
memory usage: 47.0+ KB
None
--------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   unnamed: 2  50 non-null     object
 3   unnamed: 3  12 non-null     object
 4   unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB
None
--------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5171 entries, 0 to 5170
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   unnamed: 0  5171 non-null   int64
 1   label       5171 non-null   object
 2   text        5171 non-null   object
 3   labelnum    5171 non-null   int64
dtypes: int64(2), object(2)
memory usage: 161.7+ KB
None
--------------------------------------------------------

Since majority of the data follows the pattern of Message and Category, we will stick to that

### Standarizing DF5

In [69]:
df5.head()

,v1,v2,unnamed: 2,unnamed: 3,unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [70]:
df5 = df5[['v1', 'v2']].rename(columns={'v1': 'category', 'v2': 'message'})

In [71]:
df5

     category                                            message
0         ham  Go until jurong point, crazy.. Available only ...
1         ham                      Ok lar... Joking wif u oni...
2        spam  Free entry in 2 a wkly comp to win FA Cup fina...
3         ham  U dun say so early hor... U c already then say...
4         ham  Nah I don't think he goes to usf, he lives aro...
...       ...                                                ...
5567     spam  This is the 2nd time we have tried 2 contact u...
5568      ham              Will Ì_ b going to esplanade fr home?
5569      ham  Pity, * was in mood for that. So...any other s...
5570      ham  The guy did some bitching but I acted like i'd...
5571      ham                         Rofl. Its true to its name

[5572 rows x 2 columns]